# DataFrame
- Datafram is a 2D label data that can store different type od data

In [1]:
import pandas as pd
import numpy as np

In [2]:
data  = {
    'Name':"Munna Kumar",
    'Age':23,
    'Branch':"Computer Science"
    }

In [3]:
data

{'Name': 'Munna Kumar', 'Age': 23, 'Branch': 'Computer Science'}

In [4]:
# a = pd.DataFrame(data)  ## it is working when dictionary is list of dictionary or llist of values

In [5]:
data  = [{
    'Name':"Munna Kumar",
    'Age':23,
    'Branch':"Computer Science"
    }]

In [6]:
data

[{'Name': 'Munna Kumar', 'Age': 23, 'Branch': 'Computer Science'}]

In [7]:
pd.DataFrame(data)

          Name  Age            Branch
0  Munna Kumar   23  Computer Science

In [8]:
data  = [{
    'Name':["Munna Kumar","Raunak Kumar","Chhotu Kumar"],
    'Age':23,
    'Branch':"Computer Science"
    }]

In [9]:
pd.DataFrame(data)

                                        Name  Age            Branch
0  [Munna Kumar, Raunak Kumar, Chhotu Kumar]   23  Computer Science

In [10]:
## It is a dictionary of list

data = {
    'Name':['Mohan','Sahil','Deepak'],
    'Salary':[234,345,444],
    'Address':['Delhi','Punjab','Bihar']
}

In [11]:
data

{'Name': ['Mohan', 'Sahil', 'Deepak'],
 'Salary': [234, 345, 444],
 'Address': ['Delhi', 'Punjab', 'Bihar']}

In [12]:
pd.DataFrame(data)

     Name  Salary Address
0   Mohan     234   Delhi
1   Sahil     345  Punjab
2  Deepak     444   Bihar

In [13]:
# It is list of list
data = [
    ['Mohan', 234, 'Delhi'],
    ['Sahil', 345, 'Punjab'],
    ['Deepak', 444, 'Bihar']
]

In [14]:
data

[['Mohan', 234, 'Delhi'], ['Sahil', 345, 'Punjab'], ['Deepak', 444, 'Bihar']]

In [15]:
pd.DataFrame(data)

        0    1       2
0   Mohan  234   Delhi
1   Sahil  345  Punjab
2  Deepak  444   Bihar

In [16]:
data[0]

['Mohan', 234, 'Delhi']

In [17]:
len(data[0])

3

In [18]:
range(len(data[0]))

range(0, 3)

In [19]:
range(3)

range(0, 3)

In [20]:
['Col_'+str(i) for i in range(len(data[0]))]

['Col_0', 'Col_1', 'Col_2']

In [21]:
data

[['Mohan', 234, 'Delhi'], ['Sahil', 345, 'Punjab'], ['Deepak', 444, 'Bihar']]

In [22]:
pd.DataFrame(data,columns=('Col_'+str(i) for i in range(len(data[0]))))

    Col_0  Col_1   Col_2
0   Mohan    234   Delhi
1   Sahil    345  Punjab
2  Deepak    444   Bihar

In [23]:
pd.DataFrame(data,columns=('Col_'+str(i+4) for i in range(len(data[0]))))

    Col_4  Col_5   Col_6
0   Mohan    234   Delhi
1   Sahil    345  Punjab
2  Deepak    444   Bihar

In [24]:
pd.DataFrame(data,index=(range(1,len(data)+1)),columns=('Col_'+str(i) for i in range(len(data[0]))))

    Col_0  Col_1   Col_2
1   Mohan    234   Delhi
2   Sahil    345  Punjab
3  Deepak    444   Bihar

In [25]:
pd.DataFrame(data,index=range(10,len(data)+10),
             columns=['Col_'+str(i) for i in range(len(data[0]))])

     Col_0  Col_1   Col_2
10   Mohan    234   Delhi
11   Sahil    345  Punjab
12  Deepak    444   Bihar

In [26]:
## Touple of touple

In [27]:
data = (
    ('Mohan', 234, 'Delhi'),
    ('Sahil', 345, 'Punjab'),
    ('Deepak', 444, 'Bihar')
)

In [28]:
data

(('Mohan', 234, 'Delhi'), ('Sahil', 345, 'Punjab'), ('Deepak', 444, 'Bihar'))

In [29]:
pd.DataFrame(data)

        0    1       2
0   Mohan  234   Delhi
1   Sahil  345  Punjab
2  Deepak  444   Bihar

In [30]:
len(data)

3

In [31]:
range(3)

range(0, 3)

In [32]:
pd.DataFrame(data,index=range(1,len(data)+1))

        0    1       2
1   Mohan  234   Delhi
2   Sahil  345  Punjab
3  Deepak  444   Bihar

In [33]:
pd.DataFrame(data,index=range(1,len(data)+1),columns=('Munna_'+str(i) for i in range(len(data))))

  Munna_0  Munna_1 Munna_2
1   Mohan      234   Delhi
2   Sahil      345  Punjab
3  Deepak      444   Bihar

In [34]:
## tuple of list

In [35]:
data = (
    ['Mohan', 'Sahil', 'Deepak'],
    [234, 345, 444],
    ['Delhi', 'Punjab', 'Bihar']
)

In [36]:
data

(['Mohan', 'Sahil', 'Deepak'], [234, 345, 444], ['Delhi', 'Punjab', 'Bihar'])

In [37]:
len(data)

3

In [38]:
pd.DataFrame(data)

       0       1       2
0  Mohan   Sahil  Deepak
1    234     345     444
2  Delhi  Punjab   Bihar

In [39]:
pd.DataFrame(data, index=range(1, len(data)+1))

       0       1       2
1  Mohan   Sahil  Deepak
2    234     345     444
3  Delhi  Punjab   Bihar

In [40]:
## Array Approach

In [41]:
a = np.random.randint(1,100,(3,3))

In [42]:
a

array([[10, 37, 92],
       [91, 46, 92],
       [94, 34, 98]], dtype=int32)

In [43]:
pd.DataFrame(a)

    0   1   2
0  10  37  92
1  91  46  92
2  94  34  98

In [44]:
b= np.full((5,5),2)

In [45]:
b

array([[2, 2, 2, 2, 2],
       [2, 2, 2, 2, 2],
       [2, 2, 2, 2, 2],
       [2, 2, 2, 2, 2],
       [2, 2, 2, 2, 2]])

In [46]:
pd.DataFrame(b)

   0  1  2  3  4
0  2  2  2  2  2
1  2  2  2  2  2
2  2  2  2  2  2
3  2  2  2  2  2
4  2  2  2  2  2

# Data Loading on Code file for any where
- read_csv
- read_excel
- read_json
- read_html()
- read_sql()
- read_clipboard()

In [47]:
data  =pd.read_csv(r"C:\Users\Admin\Desktop\data\topic_notes.csv")

In [48]:
data

,title,category,level,description
0,Python Variables,Python,Beginner,Variables are used to store data values in Pyt...
1,Python Functions,Python,Beginner,Functions are reusable blocks of code that per...
2,React Components,React,Intermediate,Components are the building blocks of a React ...
3,Node.js Express API,Backend,Intermediate,Express is a minimal and flexible Node.js web ...

In [49]:
data = pd.read_csv("C:\\Users\Admin\\Desktop\\data\\topic_notes.csv")

In [50]:
data

,title,category,level,description
0,Python Variables,Python,Beginner,Variables are used to store data values in Pyt...
1,Python Functions,Python,Beginner,Functions are reusable blocks of code that per...
2,React Components,React,Intermediate,Components are the building blocks of a React ...
3,Node.js Express API,Backend,Intermediate,Express is a minimal and flexible Node.js web ...

In [51]:
data  = pd.read_csv("C:/Users/Admin/Desktop/data/topic_notes.csv")

In [52]:
data

,title,category,level,description
0,Python Variables,Python,Beginner,Variables are used to store data values in Pyt...
1,Python Functions,Python,Beginner,Functions are reusable blocks of code that per...
2,React Components,React,Intermediate,Components are the building blocks of a React ...
3,Node.js Express API,Backend,Intermediate,Express is a minimal and flexible Node.js web ...

# Read Github CSV FIle

In [53]:
# path = '''https://github.com/plotly/datasets/blob/master/Dash-Course/US-Exports/2011_us_ag_exports.csv?raw=true'''

In [54]:
# pd.read_csv(path)

In [55]:
table = pd.read_excel(r"C:\Users\Admin\Desktop\data\topic_notes.xlsx")

In [56]:
table

,title,category,level,description
0,Python Variables,Python,Beginner,Variables are used to store data values in Pyt...
1,Python Functions,Python,Beginner,Functions are reusable blocks of code that per...
2,React Components,React,Intermediate,Components are the building blocks of a React ...
3,Node.js Express API,Backend,Intermediate,Express is a minimal and flexible Node.js web ...

# Read Excel File

In [57]:
table = pd.ExcelFile(r"C:\Users\Admin\Desktop\data\topic_notes.xlsx")

In [58]:
table

In [59]:
table = pd.ExcelFile(r"C:\Users\Admin\Desktop\data\topic_notes.xlsx").sheet_names

In [60]:
table

['Notes']

In [61]:
df = pd.read_excel(r"C:\Users\Admin\Desktop\data\topic_notes.xlsx", sheet_name='Notes')

In [62]:
df

,title,category,level,description
0,Python Variables,Python,Beginner,Variables are used to store data values in Pyt...
1,Python Functions,Python,Beginner,Functions are reusable blocks of code that per...
2,React Components,React,Intermediate,Components are the building blocks of a React ...
3,Node.js Express API,Backend,Intermediate,Express is a minimal and flexible Node.js web ...